package com.ssf.homevisit.utils

const val VHSNC = "VHSNC"
const val VHND = "VHND"
const val ARS = "ARS"
const val ANGANWADI = "Anganwadi"
const val AM = "ಬೆಳಿಗ್ಗೆ"
const val PM = "ಮಧ್ಯಾಹ್ನ"

const val COMMON_MSG = "_date_ ರಂದು _time_ _amOrPm_ ಗೆ _mode_ ಸಭೆಯನ್ನು _place_ ಯಲ್ಲಿ ಆಯೋಜಿಸಿದೆ\n" +
        "_topics_\n" +
        "ಆಶಾ\n" +
        "SAMPOORNA SWARAJ FOUNDATION"

const val PARTICIPIANT_MSG_VHSNC = "ಮಾನ್ಯರೇ,\n" +
        "ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ _place_ ಸ್ಥಳದಲ್ಲಿ “ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ (VHSNC) ಮಾಸಿಕ ಸಭೆ”ಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ." +
        "ಸಭೆಯ ಕಾರ್ಯಸೂಚಿ:\n" +
        "_topics_\n"+
        "ತಾವುಗಳು ಸಮಯಕ್ಕೆ ಸರಿಯಾಗಿ ಆಗಮಿಸಿ ಸಭೆಯ ಉದ್ದೇಶವನ್ನು ಯಶಸ್ವಿಗೊಳಿಸಬೇಕೆಂದು ತಮ್ಮಲ್ಲಿ ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಆಶಾ: _user_\n" +
        "ಕಾರ್ಯದರ್ಶಿ - ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ\n" +
        "ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ – ಸುಗ್ಗನಹಳ್ಳಿ\n"

const val VHSNC_MSG_SPECIAL_INVITEE = "ಮಾನ್ಯರೇ,\n" +
        "ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ _place_ ಸ್ಥಳದಲ್ಲಿ “ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ (VHSNC) ಮಾಸಿಕ ಸಭೆ” ಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ.\n" +
        "ಸಭೆಯ ಕಾರ್ಯಸೂಚಿ:\n" +
        "_topics_\n" +
        "ತಾವುಗಳು ಈ ಸಭೆಗೆ ಆಗಮಿಸಿ, ಸಭೆಯ ಉದ್ದೇಶಕ್ಕೆ ಪೂರಕವಾದ ಮಾಹಿತಿಗಳನ್ನು ತಿಳಿಸಿ ಕಾರ್ಯಕ್ರಮವನ್ನು ಯಶಸ್ವಿಗೊಳಿಸಲು ಮಾರ್ಗದರ್ಶನ ನೀಡಬೇಕೆಂದು\n" +
        "ತಮ್ಮಲ್ಲಿ ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಆಶಾ: _user_\n" +
        "ಕಾರ್ಯದರ್ಶಿ - ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ\n" +
        "ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ – ಸುಗ್ಗನಹಳ್ಳಿ"

const val VHND_MSG_PARTICIPANT = "ಮಾನ್ಯರೇ,\n" +
        "ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ ಗ್ರಾಮದ ಅಂಗನವಾಡಿಯಲ್ಲಿ “ಗ್ರಾಮ ಆರೋಗ್ಯ ಪೌಷ್ಟಿಕಾಂಶ ದಿನ”ದ (VHND) ಮಾಸಿಕ ಸಭೆಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ.\n" +
        "ತಾವುಗಳು ಈ ಸಭೆಗೆ ಆಗಮಿಸಿ, ಸಭೆಯಲ್ಲಿ ನೀಡುವ “ಪೌಷ್ಟಿಕಾಂಶ ವಿಷಯ”ಗಳನ್ನು ತಿಳಿದುಕೊಂಡು ತಮ್ಮ ಆರೋಗ್ಯವನ್ನು ಕಾಪಾಡಿಕೊಳ್ಳಲು ಬೇಕಾಗುವ ಕ್ರಮಗಳನ್ನು ಅನುಸರಿಸಬೇಕೆಂದು ತಮ್ಮಲ್ಲಿ ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಆಶಾ: _user_\n" +
        "ಕಾರ್ಯದರ್ಶಿ - ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ\n" +
        "ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ – ಸುಗ್ಗನಹಳ್ಳಿ"

const val VHND_SPECIAL_MSG = "ಮಾನ್ಯರೇ,\n" +
        "ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ ಗ್ರಾಮದ ಅಂಗನವಾಡಿಯಲ್ಲಿ “ಗ್ರಾಮ ಆರೋಗ್ಯ ಪೌಷ್ಟಿಕಾಂಶ ದಿನ”ದ (VHND) ಮಾಸಿಕ ಸಭೆಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ.\n" +
        "ತಾವುಗಳು ಈ ಸಭೆಗೆ ಆಗಮಿಸಿ, “ಪೌಷ್ಟಿಕಾಂಶ ವಿಷಯ”ಗಳನ್ನು ಸಭಿಕರಿಗೆ ತಿಳಿಸಿಕೊಡಲು ಸಹಕರಿಸಬೇಕೆಂದು ತಮ್ಮಲ್ಲಿ ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಆಶಾ: _user_\n" +
        "ಕಾರ್ಯದರ್ಶಿ - ಗ್ರಾಮ ಆರೋಗ್ಯ, ನೈರ್ಮಲ್ಯ ಮತ್ತು ಪೌಷ್ಟಿಕಾಂಶ ಸಮಿತಿ\n" +
        "ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ – ಸುಗ್ಗನಹಳ್ಳಿ\n"

const val ARS_MSG_PARTICIPANT = "ಮಾನ್ಯ ಆರೋಗ್ಯ ರಕ್ಷಾ ಸಮಿತಿ ಸದಸ್ಯರೇ,\n" +
        "ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ ನಮ್ಮ ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರದಲ್ಲಿ “ಆರೋಗ್ಯ ರಕ್ಷಾ\n" +
        "ಸಮಿತಿಯ ಮಾಸಿಕ ಸಭೆ”ಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ.\n" +
        "ಸಭೆಯ ಕಾರ್ಯಸೂಚಿ:\n" +
        "_topics_\n" +
        "ಈ ಸಭೆಗೆ ತಾವುಗಳು ಸಮಯಕ್ಕೆ ಸರಿಯಾಗಿ ಆಗಮಿಸಿ ಸಭೆಯ ಉದ್ದೇಶವನ್ನು ಯಶಸ್ವಿಗೊಳಿಸಬೇಕೆಂದು ತಮ್ಮಲ್ಲಿ ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಡಾಕ್ಟರ್ - ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ\n" +
        "ಕಾರ್ಯದರ್ಶಿಗಳು - ಆರೋಗ್ಯ ರಕ್ಷಾ ಸಮಿತಿ\n" +
        "ಸುಗ್ಗನಹಳ್ಳಿ ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ"

const val ARS_SPECIAL_MSG = "ಮಾನ್ಯರೇ,\n" +
        "ಸುಗ್ಗನಹಳ್ಳಿ ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರದ ತಂಡದವರಿಂದ ಶುಭಾಶಯಗಳು.\n" +
        "ಈ ಮೂಲಕ ತಮಗೆ ತಿಳಿಯಪಡಿಸುವುದು ಏನೆಂದರೆ, ದಿನಾಂಕ _date_ ರಂದು _amOrPm_ _time_ ಸಮಯಕ್ಕೆ ನಮ್ಮ\n" +
        "ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರದಲ್ಲಿ “ಆರೋಗ್ಯ ರಕ್ಷಾ ಸಮಿತಿಯ ಮಾಸಿಕ ಸಭೆ”ಯನ್ನು ಆಯೋಜಿಸಲಾಗಿದೆ.\n" +
        "ಸದರಿ ಸಭೆಯ ಕಾರ್ಯಸೂಚಿ ಕೆಳಗಿನಂತಿದೆ:\n" +
        "_topics_\n" +
        "ಈ ಸಭೆಗೆ ತಾವುಗಳು ಸಮಯಕ್ಕೆ ಸರಿಯಾಗಿ ಆಗಮಿಸಿ ಸಭೆಯ ಉದ್ದೇಶ ಯಶಸ್ವಿಗೊಳ್ಳಲು ಮಾರ್ಗದರ್ಶನ ನೀಡಬೇಕಾಗಿ ತಮ್ಮಲ್ಲಿ\n" +
        "ವಿನಂತಿಸುತ್ತೇನೆ.\n" +
        "ವಂದನೆಗಳೊಂದಿಗೆ\n" +
        "ಡಾಕ್ಟರ್ - ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ\n" +
        "ಕಾರ್ಯದರ್ಶಿಗಳು - ಆರೋಗ್ಯ ರಕ್ಷಾ ಸಮಿತಿ\n" +
        "ಸುಗ್ಗನಹಳ್ಳಿ ಪ್ರಾಥಮಿಕ ಆರೋಗ್ಯ ಕೇಂದ್ರ"